Revit 2024 API
DetailCurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual DetailCurveArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As DetailCurveArrayIterator
Visual C++
public:
virtual DetailCurveArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace